[
    {
        "reviews": [
            {
                "review_header": "unexpectedly comfortable", 
                "review_text": "I purchased this mattress for my daughter to use. Mainly because it was cheap, and fit the bed frame I purchased her. I knew it wasn’t incredibly tall, and I liked that because she’s two years old and needs to be able to crawl into her big girl bed without issues or step stools. When the mattress arrives, it’s wrapped up tightly in a roll, wrapped in several layers of plastic wrapping. Cutting the wrapping off is much like your own version of opening canned biscuits-you know it’s going to explode open at some point. It rolled out nicely and gained some more air to look flat and level and as it should. I laid it on her bed frame, no box spring needed (thanks to the frame doing both parts.) The mattress is exactly as big as I had hoped for using the dimensions given on the product description. It has held up just fine with my two year old bouncing on it all day and sleeping on it all night. I actually have fallen asleep on it a few times and can attest to the unexpected comfort. One minute its 9pm and I’m forcing my kid to fall asleep, the next minute its 5am her arm over my face and I’m feeling pretty refreshed and with no back aches despite being in the exact same position I fell asleep in. I thought I was simply being a cheapskate when I bought this mattress, but the quality has surpassed my expectations and I cannot have been happier with this purchase.", 
                "review_comment_count": "", 
                "review_posted_date": "24 Feb 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Nicole Durham"
            }, 
            {
                "review_header": "Happy happy happy", 
                "review_text": "We purchased this mattress for an outdoor swing bed my husband made out of pallets. It is very comfy for what we are using it for. We are more than happy with our purchase!", 
                "review_comment_count": "1", 
                "review_posted_date": "12 Jul 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Jennifer Templeton"
            }, 
            {
                "review_header": "It is what I needed.", 
                "review_text": "We bought these for our kid's bed. It was well packaged, and very convenient coming to our door like that. It is also very cheap, which was important to us at this time. My kid sleeps well at night. I have slept on it too but I am 29 and do not find it as comfortable as my 5year old. It is very firm. Could use some foam padding on top, I think.", 
                "review_comment_count": "1", 
                "review_posted_date": "30 Nov 2016", 
                "review_rating": "3.0 ", 
                "review_author": " Daena"
            }, 
            {
                "review_header": "you get what you pay for", 
                "review_text": "This is what you could expect a thin mattress to be. Look at the price and just remember you get what you pay for. We had bed bugs and had to replace a very expensive mattress at a time I didn't have much money to do so, so this held us over until I had more money for a better quality mattress. Yes, this is firm, yes, this is only 6 inches, so don't be shocked when you take it out of the vacuum seal. It's great quality and well put together, but don't expect a $3000 sealy mattress with this purchase.", 
                "review_comment_count": "", 
                "review_posted_date": "25 Aug 2016", 
                "review_rating": "4.0 ", 
                "review_author": " A. Harter"
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "SO GOOD. LIKE IT VERY MUCH.", 
                "review_comment_count": "", 
                "review_posted_date": "10 Feb 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "cant beat the price for the product", 
                "review_comment_count": "", 
                "review_posted_date": "05 Feb 2016", 
                "review_rating": "5.0 ", 
                "review_author": " kelle"
            }, 
            {
                "review_header": "Perfect for my kid", 
                "review_text": "Bought this for my daughter to transition out of a crib into a big girl bed. I laid on it myself and totally would've slept on it. Doesn't have the bells and whistles I'm accustomed to, but it's fine for her- in her words \"bouncy bouncy bouncy\". I would say it's a small step up from her crib mattress, which was firm and had a little spring to it, and a step down from your typical pillow top mattress, as it's missing that kinda melting squishy feeling I like in a bed, but easily obtainable by adding a topper like most reviewers said. I think it's fine as is, very satisfied with this purchase. Packaging was great, getting it out and open was very easy (and super fun!)", 
                "review_comment_count": "", 
                "review_posted_date": "09 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Dr Stupid"
            }, 
            {
                "review_header": "Good for a thinner mattress", 
                "review_text": "Nice for a 6 inch mattress but I wish I would have gotten a 10 inch instead", 
                "review_comment_count": "", 
                "review_posted_date": "07 Feb 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Jon mongesku"
            }
        ], 
        "ratings": {
            "2 star": "5%", 
            "1 star": "12%", 
            "4 star": "20%", 
            "3 star": "12%", 
            "5 star": "51%"
        }, 
        "price": "$73.86", 
        "url": "http://www.amazon.com/dp/B011397784", 
        "name": "LinenSpa 6\" Innerspring Mattress, Twin"
    }, 
    {
        "reviews": [
            {
                "review_header": "Poorly designed, completely not usable, but nice looking...", 
                "review_text": "The piece looks nice. But, as two other reviewers have noted, the top drawer is completely unusable. The \"drawer stopper\" just doesn't work properly the way it does on the bottom drawer. When you open the top one, it basically falls out and tilts down before it catches. So, everything you have in the drawer rolls up to the front. I wish I had read the reviews before purchasing. If it wasn't gonna be such a hassle to pack this assembled piece and mail it back, I'd return it and demand a refund. This is useless and false advertising. I think anyone looking at it would assume the drawers both work properly. I'm surprised a company like Amazon would represent and sell such a low quality product. Now I've spent the time ordering it, assembling it, and I'm still night table-less.", 
                "review_comment_count": "", 
                "review_posted_date": "22 Jul 2015", 
                "review_rating": "1.0 ", 
                "review_author": " josh"
            }, 
            {
                "review_header": "I love this accent table", 
                "review_text": "This is the perfect end table for my bench. It is the perfect size and looks beautiful. It is two feet tall and the perfect color to match my black bench. They are in my entryway and I get so many compliments on them. I posted a picture to show how mine looks! Easy to assemble.", 
                "review_comment_count": "", 
                "review_posted_date": "22 Nov 2015", 
                "review_rating": "5.0 ", 
                "review_author": " Carrrrrieb"
            }, 
            {
                "review_header": "The top drawer is fine \"as is\" or can be EASILY fixed.", 
                "review_text": "Finally I have a respectable place to put nighttime necessities! This item was well packaged and had only one marred area which I did not notice until I had finished assembling it, which took about 45 minutes using a phillips screwdriver and a phillips screwdriver that is bent 90 degrees in the middle which is supplied with the item (it is required to tighten some screws that are hard to get to otherwise). The defect in mine was just some flaking clear coating on the front edge of one of the sides. It looked kind of like a glaze that was peeling off of the laminate. Since I wasn't expecting perfection at this price, I just painted it over with some acrylic paint I had lying around and it looks perfect. Some have commented on the cheap dowel that keeps the top drawer in and I'll comment on that, too. For me, it's great. I have no problem with it. This is what happens: if you pull the drawer more than just a little ways out, the front end tips forward until the back of the drawer makes contact with the underside of the top of the stand. It may even slide the rest of the way open until the back of the drawer catches the dowel and the drawer stops. This causes the contents of the drawer to slide to the front of the drawer, which I quite like. Also, having the drawer tip forward is not so bad... it's kind of like it is unfolding its contents to you. To fix this drawer and make it behave like the bottom drawer, just glue a piece of wood to the top of the back wall of the top drawer, so that the back of the top drawer is essentially already making contact with the underside of the top of the stand. That is what the bottom drawer does and that is why it doesn't tip forward. If I'm bored one day, I'll probably do that myself but for now it's working just fine \"as is\".", 
                "review_comment_count": "2", 
                "review_posted_date": "02 Mar 2014", 
                "review_rating": "5.0 ", 
                "review_author": " Neal W. Davis"
            }, 
            {
                "review_header": "Took a chance on these and very happy with them! Can't beat it for $36!", 
                "review_text": "I had one really old, really large nightstand and I wanted to get rid of it and get two smaller nightstands- one for each side of the bed. So I looked at these, read the reviews, look at literally DOZENS and DOZENS of other nightstands over the course of several weeks, read those reviews, etc, etc, etc and ultimately decided to give these ones a try. What helped me make the decision: a) the rating for this nightstand was 3.5 stars, the average rating for most of the other nightstands I looked at was also 3.5 stars so I figured they were about average in terms of customer satisfaction, b) PRICE- I can think of better ways to spend $400 than on a pair of stupid nightstands! These cost me $72 and shipped FREE and c) I was soo sick and tired of shopping for nightstands I thought what the heck- good or bad at least I won't have to waste any more time SHOPPING FOR NIGHTSTANDS! Let me say I'm glad I took a chance on these! They look really nice- they came well packaged and free of damage except for the one which has a few tiny marks along one edge but you have to get down on your hands and knees and crawl halfway into it to see them! (they make markers to hide scratches in furniture) I do wish they were a tiny bit bigger or taller- I feel like these would look great next to a twin or full bed but they look a little too small next to my queen sized bed BUT they are so much nicer than what I had before. Now in regards to the other bad reviews: YES these are made out of particle board, YES they are heavy because particle board IS heavy, YES they are prone to damage- do not leave your cup of water on the top or you will get rings/water damage (use a coaster!) and over time the edges may get a little dinged up. You could, in theory, take this apart and put it back together but doing so will likely cause damage. No there is no gliding mechanism for the drawers- they just kinda sit in there and there's a little wooden peg that keeps you from pulling them the whole way out. Seriously WHAT DO YOU EXPECT FOR $36?? Were these hard to put together? I didn't think so. The instructions are just a bunch of pictures- you have to figure out which piece is which but that's not uncommon for this type of furniture. The first one took me 40 minutes (and I was eating dinner at the time!) and the second one took me just under 30 minutes working from memory. For those of you who said the holes are the wrong size those are PILOT holes- they are not supposed to be the 'right' size they are supposed to be smaller! That way when you apply the pin/screw/peg it has something to 'bite' into! (If the holes were the exact perfect size the pin/screw/peg could potentially fall back out. It has to be a tight fit!) Now I will say its VERY important that when you put the pin/screw/peg into the pilot hole you have to get it perfectly straight (90 degree angle) if its a little bit crooked you could very well drive it out through the side which would cause major damage to the unit! I made sure all of my pins were perfectly straight, lined up the next piece, a few taps with a rubber mallet and voila! What really sold me on this unit is that it uses a combination of locking pins AND wooden pegs for the main structure which is a rare thing to see on such an inexpensive piece of furniture- it makes this thing SOLID. Another really nice thing is that all the edges are \"finished\" so there's no ugly side- it looks just as good all the way around. Is this a piece of high end furniture that's going to last me the next 20 years? No! But they serve their purpose, look great and they saved me a lot of money!", 
                "review_comment_count": "", 
                "review_posted_date": "23 Oct 2015", 
                "review_rating": "5.0 ", 
                "review_author": " Beth"
            }, 
            {
                "review_header": "happy with the product", 
                "review_text": "Awesome night stands. Took a little while to build but the instructions were good. I am happy with my purchase. The only problem was one of the nobs was stripped but nothing some wood glue couldnt fix.", 
                "review_comment_count": "", 
                "review_posted_date": "17 Apr 2015", 
                "review_rating": "4.0 ", 
                "review_author": " Allie"
            }
        ], 
        "ratings": {
            "2 star": "9%", 
            "1 star": "16%", 
            "4 star": "22%", 
            "3 star": "15%", 
            "5 star": "38%"
        }, 
        "price": "$37.26", 
        "url": "http://www.amazon.com/dp/B0094G34XQ", 
        "name": "Winsome Ava Accent Table with 2-Drawer in Black Finish"
    }
]